; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star6 - direction
	Star5 - direction
	Star4 - direction
	Star7 - direction
	Star3 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star5)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star5)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
)
(:goal (and
	(have_image Phenomenon8 spectrograph1)
	(have_image Star9 thermograph0)
	(have_image Phenomenon10 thermograph0)
	(have_image Star11 thermograph0)
	(have_image Phenomenon12 spectrograph1)
	(have_image Star13 spectrograph1)
	(have_image Phenomenon14 spectrograph1)
	(have_image Star15 spectrograph1)
	(have_image Planet16 spectrograph1)
	(have_image Phenomenon17 thermograph0)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 10
2. (calibrate satellite0 instrument2 star7)
   added: (calibrated instrument2)
   goals met: 0 of 10
3. (turn_to satellite0 phenomenon14 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 10
4. (take_image satellite0 phenomenon14 instrument2 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 1 of 10
5. (turn_to satellite0 phenomenon12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 10
6. (take_image satellite0 phenomenon12 instrument2 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 2 of 10
7. (turn_to satellite0 phenomenon10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 10
8. (take_image satellite0 phenomenon10 instrument2 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 3 of 10
9. (turn_to satellite0 phenomenon17 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 10
10. (take_image satellite0 phenomenon17 instrument2 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 4 of 10
11. (turn_to satellite0 phenomenon8 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 10
12. (take_image satellite0 phenomenon8 instrument2 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 5 of 10
13. (turn_to satellite0 planet16 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet16)
   goals met: 5 of 10
14. (take_image satellite0 planet16 instrument2 spectrograph1)
   added: (have_image planet16 spectrograph1)
   goals met: 6 of 10
15. (turn_to satellite0 star11 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star11)
   goals met: 6 of 10
16. (take_image satellite0 star11 instrument2 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 7 of 10
17. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 7 of 10
18. (take_image satellite0 star13 instrument2 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 8 of 10
19. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 8 of 10
20. (take_image satellite0 star15 instrument2 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 9 of 10
21. (turn_to satellite0 star9 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star9)
   goals met: 9 of 10
22. (take_image satellite0 star9 instrument2 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 10 of 10
